Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/kata/nginx/target_count_21/repeat_28/16.txt
2020/01/26 12:44:23 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8016/
2020/01/26 12:44:53 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 39358 requests
Server Software:        nginx/1.17.7
Server Hostname:        192.168.3.100
Server Port:            8016
Document Path:          /
Document Length:        612 bytes
Concurrency Level:      100
Time taken for tests:   30.617 seconds
Complete requests:      39358
Failed requests:        0
Total transferred:      33257510 bytes
HTML transferred:       24087096 bytes
Requests per second:    1285.48 [#/sec] (mean)
Time per request:       77.792 [ms] (mean)
Time per request:       0.778 [ms] (mean, across all concurrent requests)
Transfer rate:          1060.77 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   26 126.7      5    2026
Processing:     0   47 134.4     10    1081
Waiting:        0   47 133.4     10    1081
Total:          1   73 196.9     18    2057
Percentage of the requests served within a certain time (ms)
  50%     18
  66%     29
  75%     39
  80%     47
  90%    101
  95%    439
  98%    806
  99%   1054
 100%   2057 (longest request)
2020/01/26 12:44:53 Matched stat line [Connect:        0   26 126.7      5    2026 Connect 0 26 126.7 5 2026]
2020/01/26 12:44:53 Matched stat line [Processing:     0   47 134.4     10    1081 Processing 0 47 134.4 10 1081]
2020/01/26 12:44:53 Matched stat line [Waiting:        0   47 133.4     10    1081 Waiting 0 47 133.4 10 1081]
2020/01/26 12:44:53 Matched stat line [Total:          1   73 196.9     18    2057 Total 1 73 196.9 18 2057]
2020/01/26 12:44:53 Matched percentline [  50%     18 50 18]
2020/01/26 12:44:53 Matched percentline [  66%     29 66 29]
2020/01/26 12:44:53 Matched percentline [  75%     39 75 39]
2020/01/26 12:44:53 Matched percentline [  80%     47 80 47]
2020/01/26 12:44:53 Matched percentline [  90%    101 90 101]
2020/01/26 12:44:53 Matched percentline [  95%    439 95 439]
2020/01/26 12:44:53 Matched percentline [  98%    806 98 806]
2020/01/26 12:44:53 Matched percentline [  99%   1054 99 1054]
2020/01/26 12:44:53 Matched percentline [ 100%   2057 100 2057]
{"connect":{"max":2026,"mean":26,"median":5,"min":0,"stdDev":126.69999694824219},"percentiles":{"100":2057,"50":18,"66":29,"75":39,"80":47,"90":101,"95":439,"98":806,"99":1054},"processing":{"max":1081,"mean":47,"median":10,"min":0,"stdDev":134.39999389648438},"total":{"max":2057,"mean":73,"median":18,"min":1,"stdDev":196.89999389648438},"waiting":{"max":1081,"mean":47,"median":10,"min":0,"stdDev":133.39999389648438}}